mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xj/s6e2d3xj.svd
        <!-- REGISTER "PRLL13" -->
        <register derivedFrom="PRLL0">
          <name>PRLL13</name>
          <description>PPG13 Reload Registers Low [BHW]</description>
          <addressOffset>0x2CC</addressOffset>
        </register>
        <!-- REGISTER "PRLH14" -->
        <register derivedFrom="PRLH0">
          <name>PRLH14</name>
          <description>PPG14 Reload Registers High [BHW]</description>
          <addressOffset>0x2D1</addressOffset>
        </register>
        <!-- REGISTER "PRLL14" -->
        <register derivedFrom="PRLL0">
          <name>PRLL14</name>
          <description>PPG14 Reload Registers Low [BHW]</description>
          <addressOffset>0x2D0</addressOffset>
        </register>
        <!-- REGISTER "PRLH15" -->
        <register derivedFrom="PRLH0">
          <name>PRLH15</name>
          <description>PPG15 Reload Registers High [BHW]</description>
          <addressOffset>0x2D5</addressOffset>
        </register>
        <!-- REGISTER "PRLL15" -->
        <register derivedFrom="PRLL0">
          <name>PRLL15</name>
          <description>PPG15 Reload Registers Low [BHW]</description>
          <addressOffset>0x2D4</addressOffset>
        </register>
        <!-- REGISTER "PRLH16" -->
        <register derivedFrom="PRLH0">
          <name>PRLH16</name>
          <description>PPG16 Reload Registers High [BHW]</description>
          <addressOffset>0x309</addressOffset>
        </register>
        <!-- REGISTER "PRLL16" -->
        <register derivedFrom="PRLL0">
          <name>PRLL16</name>
          <description>PPG16 Reload Registers Low [BHW]</description>
          <addressOffset>0x308</addressOffset>
        </register>
        <!-- REGISTER "PRLH17" -->
        <register derivedFrom="PRLH0">
          <name>PRLH17</name>
          <description>PPG17 Reload Registers High [BHW]</description>
          <addressOffset>0x30D</addressOffset>
        </register>
        <!-- REGISTER "PRLL17" -->
        <register derivedFrom="PRLL0">
          <name>PRLL17</name>
          <description>PPG17 Reload Registers Low [BHW]</description>
          <addressOffset>0x30C</addressOffset>
        </register>
        <!-- REGISTER "PRLH18" -->
        <register derivedFrom="PRLH0">
          <name>PRLH18</name>
          <description>PPG18 Reload Registers High [BHW]</description>
          <addressOffset>0x311</addressOffset>
        </register>
        <!-- REGISTER "PRLL18" -->
        <register derivedFrom="PRLL0">
          <name>PRLL18</name>
          <description>PPG18 Reload Registers Low [BHW]</description>
          <addressOffset>0x310</addressOffset>
        </register>
        <!-- REGISTER "PRLH19" -->
        <register derivedFrom="PRLH0">
          <name>PRLH19</name>
          <description>PPG19 Reload Registers High [BHW]</description>
          <addressOffset>0x315</addressOffset>
        </register>
        <!-- REGISTER "PRLL19" -->
        <register derivedFrom="PRLL0">
          <name>PRLL19</name>
          <description>PPG19 Reload Registers Low [BHW]</description>
          <addressOffset>0x314</addressOffset>
        </register>
        <!-- REGISTER "PRLH20" -->
        <register derivedFrom="PRLH0">
          <name>PRLH20</name>
          <description>PPG20 Reload Registers High [BHW]</description>
          <addressOffset>0x349</addressOffset>
        </register>
        <!-- REGISTER "PRLL20" -->
        <register derivedFrom="PRLL0">
          <name>PRLL20</name>
          <description>PPG20 Reload Registers Low [BHW]</description>
          <addressOffset>0x348</addressOffset>
        </register>
        <!-- REGISTER "PRLH21" -->
        <register derivedFrom="PRLH0">
          <name>PRLH21</name>
          <description>PPG21 Reload Registers High [BHW]</description>
          <addressOffset>0x34D</addressOffset>
        </register>
        <!-- REGISTER "PRLL21" -->
        <register derivedFrom="PRLL0">
          <name>PRLL21</name>
          <description>PPG21 Reload Registers Low [BHW]</description>
          <addressOffset>0x34C</addressOffset>
        </register>
        <!-- REGISTER "PRLH22" -->
        <register derivedFrom="PRLH0">
          <name>PRLH22</name>
          <description>PPG22 Reload Registers High [BHW]</description>
          <addressOffset>0x351</addressOffset>
        </register>
        <!-- REGISTER "PRLL22" -->
        <register derivedFrom="PRLL0">
          <name>PRLL22</name>
          <description>PPG22 Reload Registers Low [BHW]</description>
          <addressOffset>0x350</addressOffset>
        </register>
        <!-- REGISTER "PRLH23" -->
        <register derivedFrom="PRLH0">
          <name>PRLH23</name>
          <description>PPG23 Reload Registers High [BHW]</description>
          <addressOffset>0x355</addressOffset>
        </register>
        <!-- REGISTER "PRLL23" -->
        <register derivedFrom="PRLL0">
          <name>PRLL23</name>
          <description>PPG23 Reload Registers Low [BHW]</description>
          <addressOffset>0x354</addressOffset>
        </register>
        <!-- REGISTER "GATEC0" -->
        <register>
          <name>GATEC0</name>
          <description>PPG Gate Function Control Registers 0 [BHW]</description>
          <addressOffset>0x218</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG2" -->
            <field>
              <name>STRG2</name>
              <description>Select a trigger for PPG2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE2" -->
            <field>
              <name>EDGE2</name>
              <description>Select Start Effective Level for PPG2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG0" -->
            <field>
              <name>STRG0</name>
              <description>Select a trigger for PPG0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE0" -->
            <field>
              <name>EDGE0</name>
              <description>Select Start Effective Level for PPG0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC4" -->
        <register>
          <name>GATEC4</name>
          <description>PPG Gate Function Control Registers 4 [BHW]</description>
          <addressOffset>0x258</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG6" -->
            <field>
              <name>STRG6</name>
              <description>Select a trigger for PPG6</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE6" -->
            <field>
              <name>EDGE6</name>
              <description>Select Start Effective Level for PPG6</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG4" -->
            <field>
              <name>STRG4</name>
              <description>Select a trigger for PPG4</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE4" -->
            <field>
              <name>EDGE4</name>
              <description>Select Start Effective Level for PPG4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
